Revit 2024 API
Document.CanEnableCloudWorksharing Method
 Checks if cloud worksharing can be enabled for the cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.2
Syntax
C#
public bool CanEnableCloudWorksharing()
Visual Basic
Public Function CanEnableCloudWorksharing As Boolean
Visual C++
public:
bool CanEnableCloudWorksharing()
Return Value
 True if cloud worksharing can be enabled in the document, which also means the current document is a single user cloud model, False otherwise.
See Also
Document Class
Autodesk.Revit.DB Namespace